tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"

brew "antigen"
brew "autojump"
brew "docutils"
brew "awscli"
brew "bat"
brew "colordiff"
brew "coreutils"
brew "curl"
brew "direnv"
brew "docker-compose"
brew "exa"
brew "fd"
brew "fzf"
brew "gcc"
brew "gd"
brew "geos"
brew "gh"
brew "git"
brew "git-town"
brew "gitui"
brew "homeshick"
brew "imagemagick"
brew "ispell"
brew "jq"
brew "mysql"
brew "nkf"
brew "nodenv"
brew "pstree"
brew "ruby-build"
brew "rbenv"
brew "redis", restart_service: true
brew "ripgrep"
brew "rust"
brew "sheldon"
brew "smartmontools"
brew "starship"
brew "tldr"
brew "tree"
brew "z"
cask "arc"
cask "aquaskk"
cask "cron"
cask "docker"
cask "emacs"
cask "falcon-sql-client"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "font-source-han-code-jp"
cask "google-chrome"
cask "iterm2"
cask "logseq"
cask "ngrok"
cask "slack"
cask "visual-studio-code"
cask "vlc"
cask "warp"
vscode "buenon.scratchpads"
vscode "ckolkman.vscode-postgres"
vscode "CraigMaslowski.erb"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "kahole.magit"
vscode "malt03.rails-rspec-file-toggle"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "Orta.vscode-jest"
vscode "Prisma.prisma"
vscode "rust-lang.rust-analyzer"
vscode "Shopify.ruby-lsp"
vscode "Thadeu.vscode-run-rspec-file"
vscode "Vue.volar"
