tap "auth0/auth0-cli"
tap "azure/functions"
tap "hashicorp/tap"
tap "puma/puma"

brew "awscli"
brew "awscli-local"
brew "azure-cli"
brew "cdktf"
brew "ffmpeg"
brew "graphviz"
brew "hashicorp/tap/terraform"
brew "libpq"
brew "localstack"
brew "postgresql@11"
brew "puma/puma/puma-dev"
brew "auth0/auth0-cli/auth0"
brew "azure/functions/azure-functions-core-tools@4"

cask "aws-vault-binary"
cask "cursor-cli"
cask "gcloud-cli"
cask "mediainfo"
cask "mkvtoolnix-app"
cask "ngrok"
cask "session-manager-plugin"
cask "vlc"
cask "zoom"
