tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/services"
tap "laishulu/homebrew"

brew "bat"
brew "bitwarden-cli"
brew "colordiff"
brew "coreutils"
brew "direnv"
brew "docker"
brew "docker-buildx"
brew "editorconfig"
brew "fd"
brew "flyctl"
brew "fzf"
brew "eza"
brew "gh"
brew "git"
brew "gnu-tar"
brew "gnupg"
brew "homeshick"
brew "jq"
brew "lima"
brew "macism"
brew "mas"
brew "nkf"
brew "node-build"
brew "nodenv"
brew "pstree"
brew "rbenv"
brew "ruby-build"
brew "ripgrep"
brew "sheldon"
brew "smartmontools"
brew "starship"
brew "tldr"
brew "tree"
brew "z"

cask "anytype"
cask "aquaskk"
cask "emacs"
cask "font-sauce-code-pro-nerd-font"
cask "font-source-code-pro"
cask "google-chrome"
cask "httpie"
cask "karabiner-elements"
cask "logi-options-plus"
cask "logseq"
cask "notion-calendar"
cask "raycast"
cask "uhk-agent"
cask "visual-studio-code"
cask "warp"
cask "zed"

mas "elpy", id: 1440013765
mas "line", id: 539883307
mas "NAS Navigator2", id: 450664466
mas "slack", id: 803453959

vscode "buenon.scratchpads"
vscode "ckolkman.vscode-postgres"
vscode "CraigMaslowski.erb"
vscode "dbaeumer.vscode-eslint"
vscode "eamodio.gitlens"
vscode "esbenp.prettier-vscode"
vscode "GitHub.copilot"
vscode "github.vscode-github-actions"
vscode "kahole.magit"
vscode "malt03.rails-rspec-file-toggle"
vscode "mrmlnc.vscode-duplicate"
vscode "ms-azuretools.vscode-azurefunctions"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-docker"
vscode "MS-CEINTL.vscode-language-pack-ja"
vscode "ms-ossdata.vscode-postgresql"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.azure-account"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "mtxr.sqltools"
vscode "mtxr.sqltools-driver-pg"
vscode "Orta.vscode-jest"
vscode "rust-lang.rust-analyzer"
vscode "Shopify.ruby-lsp"
vscode "Thadeu.vscode-run-rspec-file"
